export default {
  syncType: {
    default: '0',
    list: [
      { '0': '不同步（默认）' },
      { '1': '仅系统配置' },
      { '2': '全部' }
    ]
  },
  status: {
    default: '0',
    list: [
      { '0': '离线' },
      { '1': '在线' }
    ]
  },
  code: {
    default: '0',
    list: [
      { '0': '不同步（默认）' },
      { '1': '仅系统设置' },
      { '2': '全部' }
    ]
  },
  accessType: {
    default: 'dv',
    list: [
      { dv: '数字摄像机' },
      { Encoder: '编码器' },
      { VideoPlatform: '第三方视频平台' }
    ]
  },
  streamMode: {
    default: '',
    list: [
      /* { '0': '空' }, */
      { '1': '接入转发服务' },
      { '2': '前端摄像机' }
      /* { '3': '前端摄像机(组播)' } */
    ]
  },
  days: {
    default: 'all',
    list: [
      { '1': '周一' },
      { '2': '周二' },
      { '3': '周三' },
      { '4': '周四' },
      { '5': '周五' },
      { '6': '周六' },
      { '0': '周日' }
    ]
  },
  BackUpDays: {
    default: 15,
    list: [
      { '1': '1天' },
      { '3': '3天' },
      { '5': '5天' },
      { '7': '7天' },
      { '15': '15天' }
    ]
  },
  gb: {
    ptz: {
      list: [
        { '1': '球机' },
        { '2': '半球' },
        { '3': '固定枪机' },
        { '4': '遥控枪机' }
      ]
    },
    certifiable: {
      default: '0',
      list: [
        { '0': '无效' },
        { '1': '有效' }
      ]
    },
    parental: {
      default: '0',
      list: [
        { '0': '无' },
        { '1': '有' }
      ]
    },
    registerWay: {
      default: '1',
      list: [
        { '1': '符合sip3261标准的认证注册模式' },
        { '2': '基于口令的双向认证注册模式' },
        { '3': '基于数字证书的双向认证注册模式' }
      ]
    },
    secrecy: {
      default: '0',
      list: [
        { '0': '不涉密' },
        { '1': '涉密' }
      ]
    },
    safetyWay: {
      default: '0',
      list: [
        { '0': '不采用' },
        { '2': 'S/MIME签名方式' },
        { '3': 'S/MIME加密签名同时采用方式' },
        { '4': '数字摘要方式' }
      ]
    },
    position: {
      default: '10',
      list: [
        { '1': '省际检查站' },
        { '2': '党政机关' },
        { '3': '车站码头' },
        { '4': '中心广场' },
        { '5': '体育场馆' },
        { '6': '商业中心' },
        { '7': '宗教场所' },
        { '8': '校园周边' },
        { '9': '治安复杂区域' },
        { '10': '交通干线' }
      ]
    },
    room: {
      default: '2',
      list: [
        { '1': '室外' },
        { '2': '室内' }
      ]
    },
    use: {
      default: '2',
      list: [
        { '1': '治安' },
        { '2': '交通' },
        { '3': '重点' }
      ]
    },
    supplyLight: {
      default: '1',
      list: [
        { '1': '无补光' },
        { '2': '红外补光' },
        { '3': '白光补光' }
      ]
    },
    direction: {
      default: '',
      list: [
        { '1': '东' },
        { '2': '西' },
        { '3': '南' },
        { '4': '北' },
        { '5': '东南' },
        { '6': '东北' },
        { '7': '西南' },
        { '8': '西北' }
      ]
    },
    resolution: {
      default: '',
      list: [ // 摄像机分辨率
        { '1': 'QCIF' },
        { '2': 'CIF' },
        { '3': '4CIF' },
        { '4': 'D1' },
        { '4': 'D1' },
        { '5': '720P' },
        { '6': '1080P/I' }
      ]
    }
  }
}
